b-login/models/Role.php

SELECT * FROM `role`
---
    public static function getList()
    {
        return ArrayHelper::map(Role::find()->all(),'id','name_rol');