b-login/models/User.php

SELECT * FROM `users` WHERE (`status`=1) AND (`id`='100') LIMIT 1
---
    public static function findIdentity($id)
    {
        $user=Users::find()->where(['status'=>1,'id'=>$id])->limit(1)->one();

SELECT * FROM `users` WHERE (`status`=1) AND (`username`='mike123') LIMIT 1
---
    public static function findByUsername($username)
    {
        $user=Users::find()->where(['status'=>1,'username'=>$username])->limit(1)->one();