b-login/controllers/UsersController.php

INSERT INTO `users` (`name`, `surname`, `identification`, `role_id`, `email`, `username`, `password`, `status`, `auth_key`, `access_token`) VALUES ('Mike', 'Correa', 78754706, 1, 'hola@gmail.com', 'mike123', '1jEc0dM1tfiwo', 1, 'PchLsRGOAN7rx3JqyoUWRfic9F0sM9vN', 'GkY3SI1Cu7A6S_oT-VtNeF01rgC9KckQ')
---
    public function actionCreate()
    {
        $model=new Users();

        if ($model->load(Yii::$app->request->post())) {
            $model->password=crypt($model->password,Yii::$app->params['phash']);
            $model->auth_key = Yii::$app->getSecurity()->generateRandomString();
            $model->access_token = Yii::$app->getSecurity()->generateRandomString();
            if($model->save()){

SELECT * FROM `users` WHERE `id`='6'
---
    protected function findModel($id)
    {
        if (($model = Users::findOne($id)) !== null) {